MayaPosch/Nodate/arch/stm32/cpp/tests/common.h
struct PWR_TypeDef {
  __IO uint32_t CR;
  __IO uint32_t CSR;
};


extern PWR_TypeDef* PWR;
extern I2C_TypeDef* I2C1;


#ifdef STM32F0
// STM32F0
struct RCC_TypeDef {
  __IO uint32_t CR;            //!< RCC clock control register,                                   Address offset: 0x00 
  __IO uint32_t CFGR;       //!< RCC clock configuration register,                            Address offset: 0x04 
  __IO uint32_t CIR;        //!< RCC clock interrupt register,                                Address offset: 0x08 
  __IO uint32_t APB2RSTR;   //!< RCC APB2 peripheral reset register,                          Address offset: 0x0C 
  __IO uint32_t APB1RSTR;   //!< RCC APB1 peripheral reset register,                          Address offset: 0x10 
  __IO uint32_t AHBENR;     //!< RCC AHB peripheral clock register,                           Address offset: 0x14 
  __IO uint32_t APB2ENR;    //!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 
  __IO uint32_t APB1ENR;    //!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C 
  __IO uint32_t BDCR;       //!< RCC Backup domain control register,                          Address offset: 0x20 
  __IO uint32_t CSR;        //!< RCC clock control & status register,                         Address offset: 0x24 
  __IO uint32_t AHBRSTR;    //!< RCC AHB peripheral reset register,                           Address offset: 0x28 
  __IO uint32_t CFGR2;      //!< RCC clock configuration register 2,                          Address offset: 0x2C 
  __IO uint32_t CFGR3;      //!< RCC clock configuration register 3,                          Address offset: 0x30 
  __IO uint32_t CR2;        //!< RCC clock control register 2,                                Address offset: 0x34 
};

#elif defined STM32F1
// STM32F1
struct RCC_TypeDef {
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t CIR;
  __IO uint32_t APB2RSTR;
  __IO uint32_t APB1RSTR;
  __IO uint32_t AHBENR;
  __IO uint32_t APB2ENR;
  __IO uint32_t APB1ENR;
  __IO uint32_t BDCR;
  __IO uint32_t CSR;
};


struct RTC_TypeDef {
  __IO uint32_t CRH;
  __IO uint32_t CRL;
  __IO uint32_t PRLH;
  __IO uint32_t PRLL;
  __IO uint32_t DIVH;
  __IO uint32_t DIVL;
  __IO uint32_t CNTH;
  __IO uint32_t CNTL;
  __IO uint32_t ALRH;
  __IO uint32_t ALRL;
};

#else
// STM32F4
struct RCC_TypeDef {
  __IO uint32_t CR;            //!< RCC clock control register,                                  Address offset: 0x00 
  __IO uint32_t PLLCFGR;       //!< RCC PLL configuration register,                              Address offset: 0x04 
  __IO uint32_t CFGR;          //!< RCC clock configuration register,                            Address offset: 0x08 
  __IO uint32_t CIR;           //!< RCC clock interrupt register,                                Address offset: 0x0C 
  __IO uint32_t AHB1RSTR;      //!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 
  __IO uint32_t AHB2RSTR;      //!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 
  __IO uint32_t AHB3RSTR;      //!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 
  uint32_t      RESERVED0;     //!< Reserved, 0x1C                                                                    
  __IO uint32_t APB1RSTR;      //!< RCC APB1 peripheral reset register,                          Address offset: 0x20 
  __IO uint32_t APB2RSTR;      //!< RCC APB2 peripheral reset register,                          Address offset: 0x24 
  uint32_t      RESERVED1[2];  //!< Reserved, 0x28-0x2C                                                               
  __IO uint32_t AHB1ENR;       //!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 
  __IO uint32_t AHB2ENR;       //!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 
  __IO uint32_t AHB3ENR;       //!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 
  uint32_t      RESERVED2;     //!< Reserved, 0x3C                                                                    
  __IO uint32_t APB1ENR;       //!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 
  __IO uint32_t APB2ENR;       //!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 
  uint32_t      RESERVED3[2];  //!< Reserved, 0x48-0x4C                                                               
  __IO uint32_t AHB1LPENR;     //!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 
  __IO uint32_t AHB2LPENR;     //!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 
  __IO uint32_t AHB3LPENR;     //!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 
  uint32_t      RESERVED4;     //!< Reserved, 0x5C                                                                    
  __IO uint32_t APB1LPENR;     //!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 
  __IO uint32_t APB2LPENR;     //!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 
  uint32_t      RESERVED5[2];  //!< Reserved, 0x68-0x6C                                                               
  __IO uint32_t BDCR;          //!< RCC Backup domain control register,                          Address offset: 0x70 
  __IO uint32_t CSR;           //!< RCC clock control & status register,                         Address offset: 0x74 
  uint32_t      RESERVED6[2];  //!< Reserved, 0x78-0x7C                                                               
  __IO uint32_t SSCGR;         //!< RCC spread spectrum clock generation register,               Address offset: 0x80 
  __IO uint32_t PLLI2SCFGR;    //!< RCC PLLI2S configuration register,                           Address offset: 0x84 
};

#endif

extern RCC_TypeDef* RCC;
extern RTC_TypeDef* RTC;


struct SPI_TypeDef {
  __IO uint32_t CR1;
  __IO uint32_t CR2;
  __IO uint32_t SR;
  __IO uint32_t DR;
  __IO uint32_t CRCPR;
  __IO uint32_t RXCRCR;
  __IO uint32_t TXCRCR;
  __IO uint32_t I2SCFGR;
};

extern SPI_TypeDef* SPI1;


#ifdef STM32F0
// STM32F0
struct SYSCFG_TypeDef {
  __IO uint32_t CFGR1;       //!< SYSCFG configuration register 1,                           Address offset: 0x00 
       uint32_t RESERVED;    //!< Reserved,                                                                  0x04 
  __IO uint32_t EXTICR[4];   //!< SYSCFG external interrupt configuration register,     Address offset: 0x14-0x08 
  __IO uint32_t CFGR2;       //!< SYSCFG configuration register 2,                           Address offset: 0x18 
};

#else
// STM32F4
struct SYSCFG_TypeDef {
  __IO uint32_t MEMRMP;       /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
  __IO uint32_t PMC;          /*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04      */
  __IO uint32_t EXTICR[4];    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
  uint32_t      RESERVED[2];  /*!< Reserved, 0x18-0x1C                                                          */
  __IO uint32_t CMPCR;        /*!< SYSCFG Compensation cell control register,         Address offset: 0x20      */
};
#endif

extern SYSCFG_TypeDef* SYSCFG;

struct DMA_Channel_TypeDef {
  __IO uint32_t CCR;
  __IO uint32_t CNDTR;
  __IO uint32_t CPAR;
  __IO uint32_t CMAR;
};

struct DMA_TypeDef {
  __IO uint32_t ISR;
  __IO uint32_t IFCR;
};


struct EXTI_TypeDef {
  __IO uint32_t IMR;          /*!<EXTI Interrupt mask register,                 Address offset: 0x00 */
  __IO uint32_t EMR;          /*!<EXTI Event mask register,                     Address offset: 0x04 */
  __IO uint32_t RTSR;         /*!<EXTI Rising trigger selection register ,      Address offset: 0x08 */
  __IO uint32_t FTSR;         /*!<EXTI Falling trigger selection register,      Address offset: 0x0C */
  __IO uint32_t SWIER;        /*!<EXTI Software interrupt event register,       Address offset: 0x10 */
  __IO uint32_t PR;           /*!<EXTI Pending register,                        Address offset: 0x14 */
};

extern EXTI_TypeDef* EXTI;

#if defined STM32F1
enum IRQn_Type {
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M3 Hard Fault Interrupt                     */
  MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt              */
  BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
  UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                       */
  DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                       */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                   */

/******  STM32 specific Interrupt Numbers *********************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                            */
  PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detection Interrupt            */
  TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
  RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
  FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
  RCC_IRQn                    = 5,      /*!< RCC global Interrupt                                 */
  EXTI0_IRQn                  = 6,      /*!< EXTI Line0 Interrupt                                 */
  EXTI1_IRQn                  = 7,      /*!< EXTI Line1 Interrupt                                 */
  EXTI2_IRQn                  = 8,      /*!< EXTI Line2 Interrupt                                 */
  EXTI3_IRQn                  = 9,      /*!< EXTI Line3 Interrupt                                 */
  EXTI4_IRQn                  = 10,     /*!< EXTI Line4 Interrupt                                 */
  DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
  DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */
  ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
  USB_HP_CAN1_TX_IRQn         = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USB_LP_CAN1_RX0_IRQn        = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn               = 22,     /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn                = 23,     /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_IRQn               = 24,     /*!< TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn                = 25,     /*!< TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn           = 26,     /*!< TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn                   = 28,     /*!< TIM2 global Interrupt                                */
  TIM3_IRQn                   = 29,     /*!< TIM3 global Interrupt                                */
  TIM4_IRQn                   = 30,     /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn                = 31,     /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn                = 32,     /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn                = 33,     /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn                = 34,     /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
  SPI2_IRQn                   = 36,     /*!< SPI2 global Interrupt                                */
  USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
  USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
  USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn              = 40,     /*!< External Line[15:10] Interrupts                      */
  RTC_Alarm_IRQn              = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
  USBWakeUp_IRQn              = 42,     /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
};
#else
 /*!< Interrupt Number Definition */
enum IRQn_Type {
/******  Cortex-M0 Processor Exceptions Numbers **************************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                        */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M0 Hard Fault Interrupt                                */
  SVC_IRQn                    = -5,     /*!< 11 Cortex-M0 SV Call Interrupt                                  */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0 Pend SV Interrupt                                  */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M0 System Tick Interrupt                              */

/******  STM32F0 specific Interrupt Numbers ******************************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                               */
  PVD_VDDIO2_IRQn             = 1,      /*!< PVD & VDDIO2 Interrupt through EXTI Lines 16 and 31             */
  RTC_IRQn                    = 2,      /*!< RTC Interrupt through EXTI Lines 17, 19 and 20                  */
  FLASH_IRQn                  = 3,      /*!< FLASH global Interrupt                                          */
  RCC_CRS_IRQn                = 4,      /*!< RCC & CRS global Interrupt                                      */
  EXTI0_1_IRQn                = 5,      /*!< EXTI Line 0 and 1 Interrupt                                     */
  EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupt                                     */
  EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupt                                     */
  TSC_IRQn                    = 8,      /*!< Touch Sensing Controller Interrupts                             */
  DMA1_Channel1_IRQn          = 9,      /*!< DMA1 Channel 1 Interrupt                                        */
  DMA1_Channel2_3_IRQn        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupt                          */
  DMA1_Channel4_5_IRQn        = 11,     /*!< DMA1 Channel 4 and Channel 5 Interrupt                          */
  ADC1_IRQn                   = 12,     /*!< ADC1 Interrupt                                                  */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupt           */
  TIM1_CC_IRQn                = 14,     /*!< TIM1 Capture Compare Interrupt                                  */
  TIM2_IRQn                   = 15,     /*!< TIM2 global Interrupt                                           */
  TIM3_IRQn                   = 16,     /*!< TIM3 global Interrupt                                           */
  TIM14_IRQn                  = 19,     /*!< TIM14 global Interrupt                                          */
  TIM16_IRQn                  = 21,     /*!< TIM16 global Interrupt                                          */
  TIM17_IRQn                  = 22,     /*!< TIM17 global Interrupt                                          */
  I2C1_IRQn                   = 23,     /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup)      */
  SPI1_IRQn                   = 25,     /*!< SPI1 global Interrupt                                           */
  SPI2_IRQn                   = 26,     /*!< SPI2 global Interrupt                                           */
  USART1_IRQn                 = 27,     /*!< USART1 global Interrupt & EXTI Line25 Interrupt (USART1 wakeup) */
  USART2_IRQn                 = 28,     /*!< USART2 global Interrupt                                         */
  CEC_CAN_IRQn                = 30,     /*!< CEC and CAN global Interrupts & EXTI Line27 Interrupt           */
  USB_IRQn                    = 31      /*!< USB global Interrupt  & EXTI Line18 Interrupt                   */
};
#endif

/**
  \brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC).
 */
struct NVIC_Type {
  __IOM uint32_t ISER[1U];               /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register */
        uint32_t RESERVED0[31U];
  __IOM uint32_t ICER[1U];               /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register */
        uint32_t RSERVED1[31U];
  __IOM uint32_t ISPR[1U];               /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register */
        uint32_t RESERVED2[31U];
  __IOM uint32_t ICPR[1U];               /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register */
        uint32_t RESERVED3[31U];
        uint32_t RESERVED4[64U];
  __IOM uint32_t IP[8U];                 /*!< Offset: 0x300 (R/W)  Interrupt Priority Register */
};

extern NVIC_Type* NVIC;


